{
  "classes": [
    "Barbarian",
    "Bard",
    "Cleric",
    "Druid",
    "Fighter",
    "Monk",
    "Paladin",
    "Ranger",
    "Rogue",
    "Sorcerer",
    "Warlock",
    "Wizard"
  ],

  "races": [
    {
      "Dragonborn": {
        "Name": "Dragonborn",
        "AgeRange": [15, 80],
        "HeightRange": [6, 8],
        "WeightRange": [150, 400],
        "Speed": 30,
        "AbilityScore": [{ "STR": 2 }, { "CHA": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "Your skin colour is of the type associated with your draconic ancestry"
            ]
          },
          {
            "hair": null
          }
        ],
        "AdditionalNotes": [
          "Breath Weapon: You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After you use your breath weapon, you can’t use it again until you complete a short or long rest.",
          "Damage Resistance: You have resistance to the damage type associated with your draconic ancestry.",
          {
            "DraconicAncestry": [
              { "Black Dragon Ancestry": "Acid 5x30ft line" },
              { "Blue Dragon Ancestry": "Lightning 5x30ft line" },
              { "Brass Dragon Ancestry": "Fire 5x30ft line" },
              { "Bronze Dragon Ancestry": "Lightning 5x30ft line" },
              { "Copper Dragon Ancestry": "Acid 5x30ft line" },
              { "Gold Dragon Ancestry": "Fire 15ft cone" },
              { "Green Dragon Ancestry": "Poison 15ft cone" },
              { "Red Dragon Ancestry": "Fire 15ft cone" },
              { "Silver Dragon Ancestry": "Cold 15ft cone" },
              { "White Dragon Ancestry": "Cold 15ft cone" }
            ]
          }
        ],
        "Summary": "Dragonborn look very much like dragons standing erect in humanoid form, though they lack wings or a tail.",
        "DetailedSummary": "Born of dragons, as their name proclaims, the dragonborn walk proudly through a world that greets them with fearful incomprehension. Shaped by draconic gods or the dragons themselves, dragonborn originally hatched from dragon eggs as a unique race, combining the best attributes of dragons and humanoids. Some dragonborn are faithful servants to true dragons, others form the ranks of soldiers in great wars, and still others find themselves adrift, with no clear calling in life."
      }
    },
    {
      "Hill Dwarf": {
        "Name": "Hill Dwarf",
        "AgeRange": [50, 350],
        "HeightRange": [4, 5],
        "WeightRange": [100, 250],
        "Speed": 25,
        "AbilityScore": [{ "CON": 2 }, { "WIS": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Dwarven Resilience: You have advantage on saving throws against poison, and you have resistance against poison damage.",
          "Stonecunning: Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
          "Dwarven Toughness: Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
        ],
        "Summary": "Bold and hardy, dwarves are known as skilled warriors, miners, and workers of stone and metal.",
        "DetailedSummary": "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience. The gold dwarves of Faerûn in their mighty southern kingdom are hill dwarves, as are the exiled Neidar and the debased Klar of Krynn in the Dragonlance setting."
      }
    },
    {
      "Mountain Dwarf": {
        "Name": "Mountain Dwarf",
        "AgeRange": [50, 350],
        "HeightRange": [4, 5],
        "WeightRange": [100, 250],
        "Speed": 25,
        "AbilityScore": [{ "CON": 2 }, { "STR": 2 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Dwarven Resilience: You have advantage on saving throws against poison, and you have resistance against poison damage.",
          "Stonecunning: Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
        ],
        "Summary": "Bold and hardy, dwarves are known as skilled warriors, miners, and workers of stone and metal.",
        "DetailedSummary": "As a mountain dwarf, you’re strong and hardy, accustomed to a difficult life in rugged terrain. You’re probably on the tall side (for a dwarf), and tend toward lighter coloration. The shield dwarves of northern Faerûn, as well as the ruling Hylar clan and the noble Daewar clan of Dragonlance, are mountain dwarves."
      }
    },
    {
      "Eladrin Elf": {
        "Name": "Eladrin Elf",
        "AgeRange": [100, 750],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 30,
        "AbilityScore": [{ "DEX": 2 }, { "INT": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Keen Senses: you have proficiency in the Perception Skill",
          "Fey Ancestry: you have advantage on saving throws against being charmed, and magic can’t put you to sleep.",
          "Trance; elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
          "Fey Step: You can cast the misty step spell once using this trait. You regain the ability to do so when you finish a short or long rest."
        ],
        "Summary": "Elves are a magical people of otherworldly grace, living in the world but not entirely part of it.",
        "DetailedSummary": "Creatures of magic with strong ties to nature, eladrin live in the twilight realm of the Feywild. Their cities sometimes cross over to the Material Plane, appearing briefly in mountain valleys or deep forest glades before fading back into the Feywild."
      }
    },
    {
      "High Elf": {
        "Name": "High Elf",
        "AgeRange": [100, 750],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 30,
        "AbilityScore": [{ "DEX": 2 }, { "INT": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Keen Senses; you have proficiency in the Perception Skill",
          "Fey Ancestry; you have advantage on saving throws against being charmed, and magic can’t put you to sleep.",
          "Trance; elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
          "Cantrip: You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it."
        ],
        "Summary": "Elves are a magical people of otherworldly grace, living in the world but not entirely part of it.",
        "DetailedSummary": "As a high elf, you have a keen mind and a mastery of at least the basics of magic. In many of the worlds of D&D, there are two kinds of high elves. One type (which includes the gray elves and valley elves of Greyhawk, the Silvanesti of Dragonlance, and the sun elves of the Forgotten Realms) is haughty and reclusive, believing themselves to be superior to non-elves and even other elves. The other type (including the high elves of Greyhawk, the Qualinesti of Dragonlance, and the moon elves of the Forgotten Realms) are more common and more friendly, and often encountered among humans and other races. The sun elves of Faerûn (also called gold elves or sunrise elves) have bronze skin and hair of copper, black, or golden blond. Their eyes are golden, silver, or black. Moon elves (also called silver elves or gray elves) are much paler, with alabaster skin sometimes tinged with blue. They often have hair of silver-white, black, or blue, but various shades of blond, brown, and red are not uncommon. Their eyes are blue or green and flecked with gold."
      }
    },
    {
      "Wood Elf": {
        "Name": "Wood Elf",
        "AgeRange": [100, 750],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 35,
        "AbilityScore": [{ "DEX": 2 }, { "WIS": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Keen Senses; you have proficiency in the Perception Skill",
          "Fey Ancestry; you have advantage on saving throws against being charmed, and magic can’t put you to sleep.",
          "Trance; elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
          "Mask of the Wild; you can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
        ],
        "Summary": "Elves are a magical people of otherworldly grace, living in the world but not entirely part of it.",
        "DetailedSummary": "As a wood elf, you have keen senses and intuition, and your fleet feet carry you quickly and stealthily through your native forests. This category includes the wild elves (grugach) of Greyhawk and the Kagonesti of Dragonlance, as well as the races called wood elves in Greyhawk and the Forgotten Realms. In Faerûn, wood elves (also called wild elves, green elves, or forest elves) are reclusive and distrusting of non-elves. Wood elves’ skin tends to be copperish in hue, sometimes with traces of green. Their hair tends toward browns and blacks, but it is occasionally blond or copper-colored. Their eyes are green, brown, or hazel."
      }
    },
    {
      "Air Genasi": {
        "Name": "Air Genasi",
        "AgeRange": [20, 120],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 30,
        "AbilityScore": [{ "CON": 2 }, { "DEX": 1 }],
        "PhysicalCharacteristics": [
          { "skin": ["light blue"] },
          { "hair": ["light blue"] }
        ],
        "AdditionalNotes": [
          "Unending Breath: You can hold your breath indefinitely while you’re not incapacitated.",
          "Mingle with the Wind: You can cast the levitate spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for this spell."
        ],
        "Summary": "Genasi carry the power of the elemental planes of air, earth, fire, and water in their blood.",
        "DetailedSummary": "As an air genasi, you are descended from the djinn. As changeable as the weather, your moods shift from calm to wild and violent with little warning, but these storms rarely last long. Air genasi typically have light blue skin, hair, and eyes. A faint but constant breeze accompanies them, tousling the hair and stirring the clothing. Some air genasi speak with breathy voices, marked by a faint echo. A few display odd patterns in their flesh or grow crystals from their scalps."
      }
    },
    {
      "Earth Genasi": {
        "Name": "Earth Genasi",
        "AgeRange": [20, 120],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 30,
        "AbilityScore": [{ "CON": 2 }, { "STR": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber",
              "earth-encrusted",
              "mud-coloured",
              "dull iron",
              "a coating of tiny embedded crystals covering their"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Earth Walk: You can move across difficult terrain made of earth or stone without expending extra movement.",
          "Merge with Stone: You can cast the pass without trace spell once with this trait, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for this spell."
        ],
        "Summary": "Genasi carry the power of the elemental planes of air, earth, fire, and water in their blood.",
        "DetailedSummary": "As an earth genasi, you are descended from the cruel and greedy dao, though you aren’t necessarily evil. You have inherited some measure of control over earth, reveling in superior strength and solid power. You tend to avoid rash decisions, pausing long enough to consider your options before taking action. Elemental earth manifests differently from one individual to the next. Some earth genasi always have bits of dust falling from their bodies and mud clinging to their clothes, never getting clean no matter how often they bathe. Others are as shiny and polished as gemstones, with skin tones of deep brown or black, eyes sparkling like agates. Earth genasi can also have smooth metallic flesh, dull iron skin spotted with rust, a pebbled and rough hide, or even a coating of tiny embedded crystals. The most arresting have fissures in their flesh, from which faint light shines."
      }
    },
    {
      "Fire Genasi": {
        "Name": "Fire Genasi",
        "AgeRange": [20, 120],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 30,
        "AbilityScore": [{ "CON": 2 }, { "INT": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": ["red"] }
        ],
        "AdditionalNotes": [
          "Darkvision: You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. Your ties to the Elemental Plane of Fire make your darkvision unusual: everything you see in darkness is in a shade of red.",
          "Fire Resistance: You have resistance to fire damage.",
          "Reach to the Blaze: You know the produce flame cantrip. Once you reach 3rd level, you can cast the burning hands spell once with this trait as a 1st-level spell, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
        ],
        "Summary": "Genasi carry the power of the elemental planes of air, earth, fire, and water in their blood.",
        "DetailedSummary": "As a fire genasi, you have inherited the volatile mood and keen mind of the efreet. You tend toward impatience and making snap judgments. Rather than hide your distinctive appearance, you exult in it. Nearly all fire genasi are feverishly hot as if burning inside, an impression reinforced by flaming red, coal- black, or ash-gray skin tones. The more human-looking have fiery red hair that writhes under extreme emotion, while more exotic specimens sport actual flames dancing on their heads. Fire genasi voices might sound like crackling flames, and their eyes flare when angered. Some are accompanied by the faint scent of brimstone."
      }
    },
    {
      "Water Genasi": {
        "Name": "Water Genasi",
        "AgeRange": [20, 120],
        "HeightRange": [5, 6],
        "WeightRange": [100, 250],
        "Speed": 30,
        "AbilityScore": [{ "CON": 2 }, { "WIS": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Acid Resistance: You have resistance to acid damage.",
          "Amphibious: You can breathe air and water.",
          "Swim: You have a swimming speed of 30 feet.",
          "Call to the Wave: You know the shape water cantrip. When you reach 3rd level, you can cast the create or destroy water spell as a 2nd-level spell once with this trait, and you regain the ability to cast it this way when you finish a long rest. Constitution is your spellcasting ability for these spells."
        ],
        "Summary": "Genasi carry the power of the elemental planes of air, earth, fire, and water in their blood.",
        "DetailedSummary": "The lapping of waves, the spray of sea foam on the wind, the ocean depths—all of these things call to your heart. You wander freely and take pride in your independence, though others might consider you selfish. Most water genasi look as if they just finished bathing, with beads of moisture collecting on their skin and hair. They smell of fresh rain and clean water. Blue or green skin is common, and most have somewhat overlarge eyes, blue-black in color. A water genasi’s hair might float freely, swaying and waving as if underwater. Some have voices with undertones reminiscent of whale song or trickling streams."
      }
    },
    {
      "Deep Gnome": {
        "Name": "Deep Gnome",
        "AgeRange": [25, 250],
        "HeightRange": [3, 4],
        "WeightRange": [80, 120],
        "Speed": 25,
        "AbilityScore": [{ "INT": 2 }, { "DEX": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Superior Darkvision: Your darkvision has a radius of 120 feet.",
          "Gnome Cunning: You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.",
          "Stone Camouflage: You have advantage on Dexterity (stealth) checks to hide in rocky terrain."
        ],
        "Summary": "A gnome’s energy and enthusiasm for living shines through every inch of his or her tiny body.",
        "DetailedSummary": "Forest gnomes and rock gnomes are the gnomes most commonly encountered in the lands of the surface world. There is another subrace of gnomes rarely seen by any surface-dweller: deep gnomes, also known as svirfneblin. Guarded, and suspicious of outsiders, svirfneblin are cunning and taciturn, but can be just as kind-hearted, loyal, and compassionate as their surface cousins."
      }
    },
    {
      "Rock Gnome": {
        "Name": "Rock Gnome",
        "AgeRange": [40, 500],
        "HeightRange": [3, 4],
        "WeightRange": [35, 55],
        "Speed": 25,
        "AbilityScore": [{ "INT": 2 }, { "CON": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Gnome Cunning: You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.",
          "Artificer’s Lore: Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
        ],
        "Summary": "A gnome’s energy and enthusiasm for living shines through every inch of his or her tiny body.",
        "DetailedSummary": "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes. Most gnomes in the worlds of D&D are rock gnomes, including the tinker gnomes of the Dragonlance setting."
      }
    },
    {
      "Goliath": {
        "Name": "Goliath",
        "AgeRange": [18, 100],
        "HeightRange": [7, 8],
        "WeightRange": [280, 340],
        "Speed": 30,
        "AbilityScore": [{ "STR": 2 }, { "CON": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "grey",
              "tawny beige"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Natural Athlete: You have proficiency in the Athletics skill.",
          "Stone’s Endurance: You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage by that total. After you use this trait, you can’t use it again until you finish a short or long rest.",
          "Powerful Build: You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.",
          "Mountain Born: You’re acclimated to high altitude, including elevations above 20,000 feet. You’re also naturally adapted to cold climate."
        ],
        "Summary": "Strong and reclusive, every day brings a new challenge to a goliath.",
        "DetailedSummary": "At the highest mountain peaks — far above the slopes where trees grow and where the air is thin and the frigid winds howl — dwell the reclusive goliaths. Few folk can claim to have seen a goliath, and fewer still can claim friendship with them. Goliaths wander a bleak realm of rock, wind, and cold. Their bodies look as if they are carved from mountain stone and give them great physical power. Their spirits take after the wandering wind, making them nomads who wander from peak to peak. Their hearts are infused with the cold regard of their frigid realm, leaving each goliath with the responsibility to earn a place in the tribe or die trying."
      }
    },
    {
      "Half-Elf": {
        "Name": "Half-Elf",
        "AgeRange": [20, 180],
        "HeightRange": [5, 6],
        "WeightRange": [],
        "Speed": 30,
        "AbilityScore": [{ "CHA": 2 }, { "": 1 }, { "": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Fey Ancestry: you have advantage on saving throws against being charmed, and magic can’t put you to sleep.",
          "Skill Versatility: You gain proficiency in two skills of your choice."
        ],
        "Summary": "Half-elves combine what some say are the best qualities of their elf and human parents.",
        "DetailedSummary": "Walking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes of the elves. Some half-elves live among humans, set apart by their emotional and physical differences, watching friends and loved ones age while time barely touches them. Others live with the elves, growing restless as they reach adulthood in the timeless elven realms, while their peers continue to live as children. Many half-elves, unable to fit into either society, choose lives of solitary wandering or join with other misfits and outcasts in the adventuring life."
      }
    },
    {
      "Half-Orc": {
        "Name": "Half-Orc",
        "AgeRange": [14, 75],
        "HeightRange": [5, 6],
        "WeightRange": [150, 300],
        "Speed": 30,
        "AbilityScore": [{ "STR": 2 }, { "CON": 1 }],
        "PhysicalCharacteristics": [{ "skin": [] }, { "hair": [] }],
        "AdditionalNotes": [
          "Darkvision: Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Menacing: You gain proficiency in the Intimidation skill.",
          "Relentless Endurance: When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest.",
          "Savage Attacks: When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."
        ],
        "Summary": "Half-orcs’ grayish pigmentation, sloping foreheads, jutting jaws, prominent teeth, and towering builds make their orcish heritage plain for all to see.",
        "DetailedSummary": "Whether united under the leadership of a mighty warlock or having fought to a standstill after years of conflict, orc and human tribes sometimes form alliances, joining forces into a larger horde to the terror of civilized lands nearby. When these alliances are sealed by marriages, half-orcs are born. Some half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals. Some venture into the world to prove their worth among humans and other more civilized races. Many of these become adventurers, achieving greatness for their mighty deeds and notoriety for their barbaric customs and savage fury."
      }
    },
    {
      "Lightfoot Halfling": {
        "Name": "Lightfoot Halfling",
        "AgeRange": [20, 250],
        "HeightRange": [3, 4],
        "WeightRange": [35, 55],
        "Speed": 25,
        "AbilityScore": [{ "DEX": 2 }, { "CHA": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Lucky: When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.",
          "Brave: You have advantage on saving throws against being frightened.",
          "Halfling Nimbleness: You can move through the space of any creature that is of a size larger than yours.",
          "Naturally Stealthy: You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
        ],
        "Summary": "The diminutive halflings survive in a world full of larger creatures by avoiding notice or, barring that, avoiding offense.",
        "DetailedSummary": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You’re inclined to be affable and get along well with others. In the Forgotten Realms, lightfoot halflings have spread the farthest and thus are the most common variety. Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life. In the world of Greyhawk, these halflings are called hairfeet or tallfellows."
      }
    },
    {
      "Stout Halfling": {
        "Name": "Stout Halfling",
        "AgeRange": [20, 250],
        "HeightRange": [3, 4],
        "WeightRange": [35, 55],
        "Speed": 30,
        "AbilityScore": [{ "DEX": 2 }, { "CON": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Lucky: When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.",
          "Brave: You have advantage on saving throws against being frightened.",
          "Halfling Nimbleness: You can move through the space of any creature that is of a size larger than yours.",
          "Stout Resilience: You have advantage on saving throws against poison, and you have resistance against poison damage."
        ],
        "Summary": "The diminutive halflings survive in a world full of larger creatures by avoiding notice or, barring that, avoiding offense.",
        "DetailedSummary": "As a stout halfling, you’re hardier than average and have some resistance to poison. Some say that stouts have dwarven blood. In the Forgotten Realms, these halflings are called stronghearts, and they’re most common in the south."
      }
    },
    {
      "Human": {
        "Name": "Human",
        "AgeRange": [18, 100],
        "HeightRange": [5, 7],
        "WeightRange": [100, 240],
        "Speed": 30,
        "AbilityScore": [
          { "STR": 1 },
          { "DEX": 1 },
          { "CON": 1 },
          { "INT": 1 },
          { "WIS": 1 },
          { "CHA": 1 }
        ],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [],
        "Summary": "Humans are the most adaptable and ambitious people among the common races. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.",
        "DetailedSummary": "In the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given. Or maybe they feel they have something to prove to the elder races, and that’s why they build their mighty empires on the foundation of conquest and trade. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds."
      }
    },
    {
      "Tiefling": {
        "Name": "Tiefling",
        "AgeRange": [18, 140],
        "HeightRange": [5, 7],
        "WeightRange": [100, 240],
        "Speed": 30,
        "AbilityScore": [{ "CHA": 2 }, { "INT": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber",
              "bright red",
              "blue",
              "stark white",
              "bright pink",
              "dark green",
              "jet black",
              "purplish red"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Hellish Resistance: You have resistance to fire damage.",
          "Infernal Legacy: You know the thaumaturgy cantrip. When you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
        ],
        "Summary": "To be greeted with stares and whispers, to suffer violence and insult on the street, to see mistrust and fear in every eye: this is the lot of the tiefling.",
        "DetailedSummary": "To be greeted with stares and whispers, to suffer violence and insult on the street, to see mistrust and fear in every eye: this is the lot of the tiefling. And to twist the knife, tieflings know that this is because a pact struck generations ago infused the essence of Asmodeus—overlord of the Nine Hells—into their bloodline. Their appearance and their nature are not their fault but the result of an ancient sin, for which they and their children and their children’s children will always be held accountable."
      }
    },

    {
      "Aasimar": {
        "Name": "Aasimar",
        "AgeRange": [18, 140],
        "HeightRange": [5, 7],
        "WeightRange": [100, 240],
        "Speed": 30,
        "AbilityScore": [{ "CHA": 2 }, { "WIS": 1 }],
        "PhysicalCharacteristics": [
          {
            "skin": [
              "dark",
              "fair",
              "pale",
              "dusky",
              "brown",
              "copper",
              "russet, reddish-brown",
              "ochre, brownish-yellow",
              "tawny beige",
              "umber"
            ]
          },
          { "hair": [] }
        ],
        "AdditionalNotes": [
          "Darkvision: Thanks to your celestial heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
          "Celestial Resistance: You have resistance to necrotic damage and radiant damage.",
          "Celestial Legacy: You know the light cantrip. Once you reach 3rd level, you can cast the lesser restoration spell once with this trait, and you regain the ability to do so when you finish a long rest. Once you reach 5th level, you can cast the daylight spell once with this trait as a 3rd-level spell, and you regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
        ],
        "Summary": "Aasimar are placed in the world to serve as guardians of law and good. Their patrons expect them to strike at evil, lead by example, and further the cause of justice.",
        "DetailedSummary": "Whereas tieflings have fiendish blood in their veins, aasimar are the descendants of celestial beings. These folk generally appear as glorious humans with lustrous hair, flawless skin, and piercing eyes. Aasimar often attempt to pass as humans in order to right wrongs and defend goodness on the Material Plane without drawing undue attention to their celestial heritage. They strive to fit into society, although they usually rise to the top, becoming revered leaders and honorable heroes."
      }
    }
  ],

  "alignments": [
    "Lawful Good",
    "Lawful Neutral",
    "Lawful Evil",
    "Neutral Good",
    "Neutral",
    "Neutral Evil",
    "Chaotic Good",
    "Chaotic Neutral",
    "Chaotic Evil"
  ],

  "physicalCharacteristics": [
    {
      "eyes": [
        "Brown",
        "Hazel",
        "Blue",
        "Green",
        "Grey",
        "Amber",
        "Light Blue",
        "Ice Blue",
        "Black",
        "Teal",
        "Icy Green",
        "Pale Gold",
        "Gold",
        "Orange",
        "Pale Purple",
        "Purple",
        "Magenta",
        "Pale"
      ]
    },
    { "gender": ["Male", "Female"] }
  ],

  "lifestyles": [
    "Wretched",
    "Squalid",
    "Poor",
    "Modest",
    "Comfortable",
    "Wealthy",
    "Aristocratic"
  ],

  "backgrounds": [
    {
      "Acolyte": {
        "name": "Acolyte",
        "background_feature": {
          "Shelter of the Faithful": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle. You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
        },

        "personality_traits": [
          "I idolize a particular hero of my faith, and constantly refer to that person’s deeds and example.",
          "I can find common ground between the fiercest enemies, empathizing with them and always working toward peace.",
          "I see omens in every event and action. The gods try to speak to us, we just need to listen.",
          "Nothing can shake my optimistic attitude.",
          "I quote (or misquote) sacred texts and proverbs in almost every situation.",
          "I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods.",
          "I’ve enjoyed fine food, drink, and high society among my temple’s elite. Rough living grates on me.",
          "I’ve spent so long in the temple that I have little practical experience dealing with people in the outside world."
        ],
        "ideals": [
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Tradition. The ancient traditions of worship and sacrifice must be preserved and upheld."
            }
          ],
          [
            { "alignment": "Good" },
            {
              "ideal": "Charity. I always try to help those in need, no matter what the personal cost. "
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "Change. We must help bring about the changes the gods are constantly working in the world. "
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Power. I hope to one day rise to the top of my faith’s religious hierarchy. "
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Faith. I trust that my deity will guide my actions. I have faith that if I work hard, things will go well. "
            }
          ],
          [
            { "alignment": "Any" },
            {
              "ideal": "Aspiration. I seek to prove myself worthy of my god’s favor by matching my actions against his or her teachings."
            }
          ]
        ],

        "bonds": [
          "I would die to recover an ancient relic of my faith that was lost long ago.",
          "I will someday get revenge on the corrupt temple hierarchy who branded me a heretic.",
          "I owe my life to the priest who took me in when my parents died.",
          "Everything I do is for the common people.",
          "I will do anything to protect the temple where I served.",
          "I seek to preserve a sacred text that my enemies consider heretical and seek to destroy."
        ],
        "flaws": [
          "I judge others harshly, and myself even more severely.",
          "I put too much trust in those who wield power within my temple’s hierarchy.",
          "My piety sometimes leads me to blindly trust those that profess faith in my god.",
          "I am inflexible in my thinking.",
          "I am suspicious of strangers and expect the worst of them.",
          "Once I pick a goal, I become obsessed with it to the detriment of everything else in my life."
        ]
      }
    },

    {
      "CriminalSpy": {
        "name": "Criminal / Spy",
        "background_feature": {
          "Criminal Contact": "You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specifically, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
        },
        "personality_traits": [
          "I always have a plan for what to do when things go wrong.",
          "I am always calm, no matter what the situation. I never raise my voice or let my emotions control me.",
          "The first thing I do in a new place is note the locations of everything valuable—or where such things could be hidden.",
          "I would rather make a new friend than a new enemy.",
          "I am incredibly slow to trust. Those who seem the fairest often have the most to hide.",
          "I don’t pay attention to the risks in a situation. Never tell me the odds.",
          "The best way to get me to do something is to tell me I can’t do it.",
          "I blow up at the slightest insult."
        ],
        "ideals": [
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Honor. I don’t steal from others in the trade."
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "Freedom. Chains are meant to be broken, as are those who would forge them."
            }
          ],
          [
            { "alignment": "Good" },
            {
              "ideal": "Charity. I steal from the wealthy so that I can help people in need."
            }
          ],
          [
            { "alignment": "Evil" },
            {
              "ideal": "Greed. I will do whatever it takes to become wealthy. "
            }
          ],
          [
            { "alignment": "Neutral" },
            {
              "ideal": "People. I’m loyal to my friends, not to any ideals, and everyone else can take a trip down the Styx for all I care."
            }
          ],
          [
            { "alignment": "Good" },
            {
              "ideal": "Redemption. There’s a spark of good in everyone."
            }
          ]
        ],
        "bonds": [
          "I’m trying to pay off an old debt I owe to a generous benefactor.",
          "My ill-gotten gains go to support my family.",
          "Something important was taken from me, and I aim to steal it back.",
          "I will become the greatest thief that ever lived.",
          "I’m guilty of a terrible crime. I hope I can redeem myself for it.",
          "Someone I loved died because of a mistake I made. That will never happen again."
        ],
        "flaws": [
          "When I see something valuable, I can’t think about anything but how to steal it.",
          "When faced with a choice between money and my friends, I usually choose the money.",
          "If there’s a plan, I’ll forget it. If I don’t forget it, I’ll ignore it.",
          "I have a “tell” that reveals when I’m lying.",
          "I turn tail and run when things look bad.",
          "An innocent person is in prison for a crime that I committed. I’m okay with that."
        ]
      }
    },

    {
      "FolkHero": {
        "name": "Folk Hero",
        "background_feature": {
          "Rustic Hospitality": "Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
        },
        "personality_traits": [
          "I judge people by their actions, not their words.",
          "If someone is in trouble, I’m always ready to lend help.",
          "When I set my mind to something, I follow through no matter what gets in my way.",
          "I have a strong sense of fair play and always try to find the most equitable solution to arguments.",
          "I’m confident in my own abilities and do what I can to instill confidence in others.",
          "Thinking is for other people. I prefer action.",
          "I misuse long words in an attempt to sound smarter.",
          "I get bored easily. When am I going to get on with my destiny?"
        ],
        "ideals": [
          [
            { "alignment": "Good" },
            {
              "ideal": "Respect. People deserve to be treated with dignity and respect."
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Fairness. No one should get preferential treatment before the law, and no one is above the law."
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "Freedom. Tyrants must not be allowed to oppress the people."
            }
          ],
          [
            { "alignment": "Evil" },
            {
              "ideal": "Might. If I become strong, I can take what I want—what I deserve."
            }
          ],
          [
            { "alignment": "Neutral" },
            {
              "ideal": "Sincerity. There’s no good in pretending to be something I’m not."
            }
          ],
          [
            { "alignment": "Any" },
            {
              "ideal": "Destiny. Nothing and no one can steer me away from my higher calling."
            }
          ]
        ],
        "bonds": [
          "I have a family, but I have no idea where they are. One day, I hope to see them again.",
          "I worked the land, I love the land, and I will protect the land.",
          "A proud noble once gave me a horrible beating, and I will take my revenge on any bully I encounter.",
          "My tools are symbols of my past life, and I carry them so that I will never forget my roots.",
          "I protect those who cannot protect themselves.",
          "I wish my childhood sweetheart had come with me to pursue my destiny."
        ],
        "flaws": [
          "The tyrant who rules my land will stop at nothing to see me killed.",
          "I’m convinced of the significance of my destiny, and blind to my shortcomings and the risk of failure.",
          "The people who knew me when I was young know my shameful secret, so I can never go home again.",
          "I have a weakness for the vices of the city, especially hard drink.",
          "Secretly, I believe that things would be better if I were a tyrant lording over the land.",
          "I have trouble trusting in my allies."
        ]
      }
    },

    {
      "HauntedOne": {
        "name": "Haunted One",
        "background_feature": {
          "Heart of Darkness": "Those who look into your eyes can see that you have faced unimaginable horror and that you are no stranger to darkness. Though they might fear you, commoners will extend you every courtesy and do their utmost to help you. Unless you have shown yourself to be a danger to them, they will even take up arms to fight alongside you, should you find yourself facing an enemy alone."
        },
        "personality_traits": [
          "I don’t run from evil. Evil runs from me.",
          "I like to read and memorize poetry. It keeps me calm and brings me fleeting moments of happiness.",
          "I spend money freely and live life to the fullest, knowing that tomorrow I might die.",
          "I live for the thrill of the hunt.",
          "I don’t talk about the thing that torments me. I’d rather not burden others with my curse.",
          "I expect danger around every corner.",
          "I refuse to become a victim, and I will not allow others to be victimized.",
          "I put no trust in divine beings."
        ],
        "ideals": [
          [
            { "alignment": "Good" },
            {
              "ideal": "I try to help those in need, no matter what the personal cost."
            }
          ],
          [
            { "alignment": "Any" },
            {
              "ideal": "I’ll stop the spirits that haunt me or die trying."
            }
          ],
          [
            { "alignment": "Good" },
            {
              "ideal": "I kill monsters to make the world a safer place, and to exorcise my own demons."
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "I have a dark calling that puts me above the law."
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal":  "I like to know my enemy’s capabilities and weaknesses before rushing into battle."
            }
          ],
          [
            { "alignment": "Evil" },
            {
              "ideal":  "I’m a monster that destroys other monsters, and anything else that gets in my way."
            }
          ]
        ],
        "bonds": [
          "I keep my thoughts and discoveries in a journal. My journal is my legacy.",
          "I would sacrifice my life and my soul to protect the innocent.",
          "My torment drove away the person I love. I strive to win back the love I’ve lost.",
          "A terrible guilt consumes me. I hope that I can find redemption through my actions.",
          "There’s evil in me, I can feel it. It must never be set free.",
          "I have a child to protect. I must make the world a safer place for them."
        ],
        "flaws": [
          "I have certain rituals that I must follow every day. I can never break them.",
          "I assume the worst in people.",
          "I feel no compassion for the dead. They’re the lucky ones.",
          "I have an addiction.",
          "I am a purveyor of doom and gloom who lives in a world without hope.",
          "I talk to spirits that no one else can see."
        ]
      }
    },

    {
      "Noble": {
        "name": "Noble",
        "background_feature": {
          "Position of Privilege": "Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."
        },
        "personality_traits": [
          "My eloquent flattery makes everyone I talk to feel like the most wonderful and important person in the world.",
          "The common folk love me for my kindness and generosity.",
          "No one could doubt by looking at my regal bearing that I am a cut above the unwashed masses.",
          "I take great pains to always look my best and follow the latest fashions.",
          "I don’t like to get my hands dirty, and I won’t be caught dead in unsuitable accommodations.",
          "Despite my noble birth, I do not place myself above other folk. We all have the same blood.",
          "My favor, once lost, is lost forever.",
          "If you do me an injury, I will crush you, ruin your name, and salt your fields."
        ],
        "ideals": [
          [
            { "alignment": "Good" },
            {
              "ideal": "Respect. Respect is due to me because of my position, but all people regardless of station deserve to be treated with dignity."
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Responsibility. It is my duty to respect the authority of those above me, just as those below me must respect mine."
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "Independence. I must prove that I can handle myself without the coddling of my family,"
            }
          ],
          [
            { "alignment": "Evil" },
            {
              "ideal": "Power. If I can attain more power, no one will tell me what to do."
            }
          ],
          [
            { "alignment": "Any" },
            {
              "ideal": "Family. Blood runs thicker than water."
            }
          ],
          [
            { "alignment": "Good" },
            {
              "ideal": "Noble Obligation. It is my duty to protect and care for the people beneath me."
            }
          ]
        ],
        
        "bonds": [
          "I will face any challenge to win the approval of my family.",
          "My house’s alliance with another noble family must be sustained at all costs.",
          "Nothing is more important than the other members of my family.",
          "I am in love with the heir of a family that my family despises.",
          "My loyalty to my sovereign is unwavering.",
          "The common folk must see me as a hero of the people."
        ],
        "flaws": [
          "I secretly believe that everyone is beneath me.",
          "I hide a truly scandalous secret that could ruin my family forever.",
          "I too often hear veiled insults and threats in every word addressed to me, and I’m quick to anger.",
          "I have an insatiable desire for carnal pleasures.",
          "In fact, the world does revolve around me.",
          "By my words and actions, I often bring shame to my family."
        ]
      }
    },

    {
      "Sage": {
        "name": "Sage",
        "background_feature": {
          "Researcher": "When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information comes from a library, scriptorium, university, or a sage or other learned person or creature. Your DM might rule that the knowledge you seek is secreted away in an almost inaccessible place, or that it simply cannot be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
        },
        "personality_traits": [
          "I use polysyllabic words that convey the impression of great erudition.",
          "I’ve read every book in the world’s greatest libraries—or I like to boast that I have.",
          "I’m used to helping out those who aren’t as smart as I am, and I patiently explain anything and everything to others.",
          "There’s nothing I like more than a good mystery.",
          "I’m willing to listen to every side of an argument before I make my own judgment.",
          "I … speak … slowly … when talking … to idiots, … which … almost … everyone … is … compared … to me.",
          "I am horribly, horribly awkward in social situations.",
          "I’m convinced that people are always trying to steal my secrets."
        ],
        "ideals": [
          [
            { "alignment": "Neutral" },
            {
              "ideal": "Knowledge. The path to power and self-improvement is through knowledge."
            }
          ],
          [
            { "alignment": "Good" },
            {
              "ideal": "Beauty. What is beautiful points us beyond itself toward what is true."
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Logic. Emotions must not cloud our logical thinking."
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "No Limits. Nothing should fetter the infinite possibility inherent in all existence. "
            }
          ],
          [
            { "alignment": "Evil" },
            {
              "ideal": "Power. Knowledge is the path to power and domination. "
            }
          ],
          [
            { "alignment": "Any" },
            {
              "ideal": "Self-Improvement. The goal of a life of study is the betterment of oneself. "
            }
          ]
        ],
        
        "bonds": [
          "It is my duty to protect my students.",
          "I have an ancient text that holds terrible secrets that must not fall into the wrong hands.",
          "I work to preserve a library, university, scriptorium, or monastery.",
          "My life’s work is a series of tomes related to a specific field of lore.",
          "I’ve been searching my whole life for the answer to a certain question.",
          "I sold my soul for knowledge. I hope to do great deeds and win it back."
        ],
        "flaws": [
          "I am easily distracted by the promise of information.",
          "Most people scream and run when they see a demon. I stop and take notes on its anatomy.",
          "Unlocking an ancient mystery is worth the price of a civilization.",
          "I overlook obvious solutions in favor of complicated ones.",
          "I speak without really thinking through my words, invariably insulting others.",
          "I can’t keep a secret to save my life, or anyone elses."
        ]
      }
    },
    {
      "Soldier": {
        "background_feature": {
          "Military Rank": "You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."
        },
        "personality_traits": [
          "I’m always polite and respectful.",
          "I’m haunted by memories of war. I can’t get the images of violence out of my mind.",
          "I’ve lost too many friends, and I’m slow to make new ones.",
          "I’m full of inspiring and cautionary tales from my military experience relevant to almost every combat situation.",
          "I can stare down a hell hound without flinching.",
          "I enjoy being strong and like breaking things.",
          "I have a crude sense of humor.",
          "I face problems head-on. A simple, direct solution is the best path to success."
        ],
        "ideals": [
          [
            { "alignment": "Good" },
            {
              "ideal": "Greater Good. Our lot is to lay down our lives in defense of others. "
            }
          ],
          [
            { "alignment": "Lawful" },
            {
              "ideal": "Responsibility. I do what I must and obey just authority. "
            }
          ],
          [
            { "alignment": "Chaotic" },
            {
              "ideal": "Independence. When people follow orders blindly, they embrace a kind of tyranny. "
            }
          ],
          [
            { "alignment": "Evil" },
            {
              "ideal": "Might. In life as in war, the stronger force wins. "
            }
          ],
          [
            { "alignment": "Neutral" },
            {
              "ideal": "Live and Let Live. Ideals aren’t worth killing over or going to war for. "
            }
          ],
          [
            { "alignment": "Any" },
            {
              "ideal": "Nation. My city, nation, or people are all that matter."
            }
          ]
        ],
        "bonds": [
          "I would still lay down my life for the people I served with.",
          "Someone saved my life on the battlefield. To this day, I will never leave a friend behind.",
          "My honor is my life.",
          "I’ll never forget the crushing defeat my company suffered or the enemies who dealt it.",
          "Those who fight beside me are those worth dying for.",
          "I fight for those who cannot fight for themselves."
        ],
        "flaws": [
          "The monstrous enemy we faced in battle still leaves me quivering with fear.",
          "I have little respect for anyone who is not a proven warrior.",
          "I made a terrible mistake in battle that cost many lives—and I would do anything to keep that mistake secret.",
          "My hatred of my enemies is blind and unreasoning.",
          "I obey the law, even if the law causes misery.",
          "I’d rather eat my armor than admit when I’m wrong."
        ]
      }
    }
  ],

  "deities": [
    [{"god": "Auril, goddess of winter"}, {"alignment": "Neutral Evil" }],
    [{"god": "Azuth, god of wizards"}, {"alignment": "Lawful Neutral" }],
    [{"god": "Bane, god of tyranny"}, {"alignment": "Lawful Evil" }],
    [{"god": "Beshaba, goddess of misfortune"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Bhaal, god of murder"}, {"alignment": "Neutral Evil" }],
    [{"god": "Chauntea, goddess of agriculture"}, {"alignment": "Neutral Good" }],
    [{"god": "Cyric, god of lies"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Deneir, god of writing"}, {"alignment": "Neutral Good" }],
    [{"god": "Eldath, goddess of peace"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Gond, god of craft"}, {"alignment": "Neutral Good" }],
    [{"god": "Helm, god of protection"}, {"alignment": "Neutral Good" }],
    [{"god": "Ilmater, god of endurance"}, {"alignment": "Neutral" }],
    [{"god": "Kelemvor, god of the dead"}, {"alignment": "Lawful Neutral" }],
    [{"god": "Lathander, god of birth and renewal"}, {"alignment": "Neutral Good" }],
    [{"god": "Leira, goddess of illusion"}, {"alignment": "Chaotic Neutral" }],
    [{"god": "Lliira, goddess of joy"}, {"alignment": "Chaotic Good" }],
    [{"god": "Loviatar, goddess of pain"}, {"alignment": "Lawful Evil" }],
    [{"god": "Malar, god of the hunt"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Mask, god of thieves"}, {"alignment": "Chaotic Neutral" }],
    [{"god": "Mielikki, goddess of forests"}, {"alignment": "Neutral Good" }],
    [{"god": "Milil, god of poetry and song"}, {"alignment": "Neutral Good" }],
    [{"god": "Myrkul, god of death"}, {"alignment": "Neutral Evil" }],
    [{"god": "Mystra, goddess of magic"}, {"alignment": "Neutral Good" }],
    [{"god": "Oghma, god of knowledge"}, {"alignment": "Neutral" }],
    [{"god": "Savras, god of divination and fate"}, {"alignment": "Lawful Neutral" }],
    [{"god": "Selûne, goddess of the moon"}, {"alignment": "Chaotic Good" }],
    [{"god": "Shar, goddess of darkness and loss"}, {"alignment": "Neutral Evil" }],
    [{"god": "Silvanus, god of wild nature"}, {"alignment": "Neutral" }],
    [{"god": "Sune, goddess of love and beauty"}, {"alignment": "Chaotic Good" }],
    [{"god": "Talona, goddess of disease and poison"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Talos, god of storms"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Tempus, god of war"}, {"alignment": "Neutral" }],
    [{"god": "Torm, god of courage and self-sacrifice"}, {"alignment": "Lawful Good" }],
    [{"god": "Tymora, goddess of good fortune"}, {"alignment": "Chaotic Good" }],
    [{"god": "Tyr, god of justice"}, {"alignment": "Lawful Good" }],
    [{"god": "Umberlee, goddess of the sea"}, {"alignment": "Chaotic Evil" }],
    [{"god": "Waukeen, goddess of trade"}, {"alignment": "Neutral"}]
  ]
}
